* Copy figures to paper folder
#+BEGIN_SRC sh :results verbatim
date
cp -v shape-conic-plot-M16-MS2070n00p10.pdf ../papers/Paper1/figs
#+END_SRC

#+RESULTS:
: Sun Nov 26 22:16:04 CST 2017
: shape-conic-plot-M16-MS2070n00p10.pdf -> ../papers/Paper1/figs/shape-conic-plot-M16-MS2070n00p10.pdf




** Fit the arcs
+ Do it like in [[id:4BC292AA-F2EB-4031-94AB-E6A36B22FD21][Circle fits to second batch of sources]]

#+BEGIN_SRC sh :results silent
  D=../read-shapes-LL
  for wav in 20mic 12mic Halpha; do
      for inc in i00 i30 i60; do
          python $D/find-xy-shell.py A16-${wav}-${inc} --pa0 0 --window 9
      done
  done
#+END_SRC



#+BEGIN_SRC sh :results verbatim
  D=../read-shapes-LL
  python $D/find-xy-shell.py --help
#+END_SRC

#+RESULTS:
#+begin_example
usage: find-xy-shell.py [-h] [--debug] [--pa0 PA0] [--window WINDOW] source

Find (X, Y) positions of shell boundaries from a DS9 region file

positional arguments:
  source           Name of source, taken as prefix for region file containing
                   shell and star positions

optional arguments:
  -h, --help       show this help message and exit
  --debug          Print out verbose debugging info about each line in region
                   file
  --pa0 PA0        Optionally over-ride guess at PA of bow shock axis
  --window WINDOW  Number of points to use when searching for min R
#+end_example

#+BEGIN_SRC sh :results verbatim
  D=../read-shapes-LL
  python $D/fit-circle-shell.py --help
#+END_SRC

#+RESULTS:
#+begin_example
usage: fit-circle-shell.py [-h] [--savefig] [--debug] [--thmax THMAX] source

Fit circles to all the arcs and save as ds9 region file

positional arguments:
  source         Name of source

optional arguments:
  -h, --help     show this help message and exit
  --savefig      Save a figure showing the fit
  --debug        Print out verbose debugging info
  --thmax THMAX  Maximum angle from axis for points to include in circle fit
#+end_example


#+BEGIN_SRC sh :results verbatim
  D=../read-shapes-LL
  for wav in 20mic 12mic Halpha; do
      for inc in i00 i30 i60; do
          python $D/fit-circle-shell.py A16-${wav}-${inc} --thmax 60 --savefig --figscale 150
      done
  done
#+END_SRC

#+RESULTS:
#+begin_example
[[Fit Statistics]]
    # function evals   = 12
    # data points      = 9
    # variables        = 2
    chi-square         = 1.500
    reduced chi-square = 0.214
    Akaike info crit   = -12.125
    Bayesian info crit = -11.731
[[Variables]]
    xc:  -0.86827844 +/- 0.484223 (55.77%) (init=-1.415982)
    yc:  -43.0169955 +/- 3.451873 (8.02%) (init=-40.94287)
[[Correlations]] (unreported correlations are <  0.100)
outer : -0.868278445549 -43.0169955505 83.9520885522
[[Fit Statistics]]
    # function evals   = 15
    # data points      = 9
    # variables        = 2
    chi-square         = 0.952
    reduced chi-square = 0.136
    Akaike info crit   = -16.222
    Bayesian info crit = -15.828
[[Variables]]
    xc:   0.26327242 +/- 0.440482 (167.31%) (init= 0.1885513)
    yc:  -56.6615451 +/- 3.378267 (5.96%) (init=-40.43253)
[[Correlations]] (unreported correlations are <  0.100)
outer : 0.263272420544 -56.6615451113 97.2688410428
[[Fit Statistics]]
    # function evals   = 21
    # data points      = 10
    # variables        = 2
    chi-square         = 12.096
    reduced chi-square = 1.512
    Akaike info crit   = 5.903
    Bayesian info crit = 6.508
[[Variables]]
    xc:  -0.94112604 +/- 2.550386 (270.99%) (init= 0.64284)
    yc:  -169.000042 +/- 51.30050 (30.36%) (init=-43.32933)
[[Correlations]] (unreported correlations are <  0.100)
outer : -0.941126046004 -169.000042284 214.24326031
[[Fit Statistics]]
    # function evals   = 15
    # data points      = 30
    # variables        = 2
    chi-square         = 3.663
    reduced chi-square = 0.131
    Akaike info crit   = -59.089
    Bayesian info crit = -56.287
[[Variables]]
    xc:  -1.88017148 +/- 0.211841 (11.27%) (init=-1.455069)
    yc:  -70.7512435 +/- 2.054985 (2.90%) (init=-44.26959)
[[Correlations]] (unreported correlations are <  0.100)
    C(xc, yc)                    =  0.181 
outer : -1.88017148162 -70.7512435821 114.932519062
[[Fit Statistics]]
    # function evals   = 15
    # data points      = 22
    # variables        = 2
    chi-square         = 9.569
    reduced chi-square = 0.478
    Akaike info crit   = -14.316
    Bayesian info crit = -12.134
[[Variables]]
    xc:  -2.02239761 +/- 0.530814 (26.25%) (init= 0.1877718)
    yc:  -77.6627673 +/- 5.505573 (7.09%) (init=-41.52165)
[[Correlations]] (unreported correlations are <  0.100)
outer : -2.02239761853 -77.6627673223 120.48605475
[[Fit Statistics]]
    # function evals   = 12
    # data points      = 12
    # variables        = 2
    chi-square         = 9.543
    reduced chi-square = 0.954
    Akaike info crit   = 1.251
    Bayesian info crit = 2.221
[[Variables]]
    xc:  -3.19000930 +/- 0.650585 (20.39%) (init=-2.587487)
    yc:  -48.1391239 +/- 6.356706 (13.20%) (init=-53.83477)
[[Correlations]] (unreported correlations are <  0.100)
    C(xc, yc)                    =  0.151 
outer : -3.19000930802 -48.1391239766 102.461613882
[[Fit Statistics]]
    # function evals   = 15
    # data points      = 15
    # variables        = 2
    chi-square         = 75.590
    reduced chi-square = 5.815
    Akaike info crit   = 28.259
    Bayesian info crit = 29.675
[[Variables]]
    xc:  -0.90720240 +/- 1.526846 (168.30%) (init=-1.735478)
    yc:  -42.2411966 +/- 9.675294 (22.90%) (init=-52.12203)
[[Correlations]] (unreported correlations are <  0.100)
outer : -0.907202408862 -42.241196604 95.2588341179
[[Fit Statistics]]
    # function evals   = 15
    # data points      = 12
    # variables        = 2
    chi-square         = 2.646
    reduced chi-square = 0.265
    Akaike info crit   = -14.140
    Bayesian info crit = -13.170
[[Variables]]
    xc:  -0.49692657 +/- 0.510309 (102.69%) (init=-0.8667289)
    yc:  -77.9597925 +/- 3.784126 (4.85%) (init=-62.6494)
[[Correlations]] (unreported correlations are <  0.100)
    C(xc, yc)                    =  0.260 
outer : -0.496926576525 -77.9597925915 141.013742592
[[Fit Statistics]]
    # function evals   = 18
    # data points      = 12
    # variables        = 2
    chi-square         = 19.731
    reduced chi-square = 1.973
    Akaike info crit   = 9.968
    Bayesian info crit = 10.937
[[Variables]]
    xc:   0.03098664 +/- 0.915668 (2955.04%) (init=-1.467732)
    yc:  -29.9301989 +/- 4.449084 (14.86%) (init=-80.68895)
[[Correlations]] (unreported correlations are <  0.100)
    C(xc, yc)                    = -0.104 
outer : 0.0309866408166 -29.930198911 110.304078185
#+end_example


#+BEGIN_SRC sh :results verbatim
  D=../read-shapes-LL
  python $D/find-xy-shell.py R97-Halpha-i00 --pa0 90 --window 9
  python $D/fit-circle-shell.py R97-Halpha-i00 --thmax 60 --savefig --figscale 300
#+END_SRC

#+RESULTS:
#+begin_example
[[Fit Statistics]]
    # function evals   = 18
    # data points      = 7
    # variables        = 2
    chi-square         = 140.998
    reduced chi-square = 28.200
    Akaike info crit   = 25.020
    Bayesian info crit = 24.912
[[Variables]]
    xc:  -47.9081712 +/- 27.37979 (57.15%) (init=-91.68763)
    yc:  -2.14965635 +/- 4.968434 (231.13%) (init=-1.367659)
[[Correlations]] (unreported correlations are <  0.100)
    C(xc, yc)                    =  0.267 
outer : -47.9081712238 -2.14965635401 142.082194775
#+end_example

** Fit arcs to Meyer 2017 shapes
#+BEGIN_SRC sh :results verbatim
  D=../read-shapes-LL
  python $D/find-xy-shell.py M17-MHD2040-AllB7 --pa0 0 --window 11
  python $D/fit-circle-shell.py M17-MHD2040-AllB7 --thmax 60 --savefig --figscale 200
#+END_SRC

#+RESULTS:
#+begin_example
[[Fit Statistics]]
    # function evals   = 18
    # data points      = 23
    # variables        = 2
    chi-square         = 17.024
    reduced chi-square = 0.811
    Akaike info crit   = -2.921
    Bayesian info crit = -0.650
[[Variables]]
    xc:   0.87844247 +/- 1.139105 (129.67%) (init= 1.09081)
    yc:  -122.078095 +/- 11.38874 (9.33%) (init=-47.69958)
[[Correlations]] (unreported correlations are <  0.100)
outer : 0.878442476821 -122.078095702 170.417646989
#+end_example

#+BEGIN_SRC sh :results silent
open M17-*-arcfits.pdf
#+END_SRC

#+BEGIN_SRC sh :results file
python shape-conic-plot.py M17-MHD2040-AllB7 
#+END_SRC

#+RESULTS:
[[file:shape-conic-plot-M17-MHD2040-AllB7.pdf]]

#+BEGIN_SRC sh :results verbatim
  D=../read-shapes-LL
  python $D/find-xy-shell.py M17-HD2040 --pa0 0 --window 11
  python $D/fit-circle-shell.py M17-HD2040 --thmax 60 --savefig --figscale 250
#+END_SRC

#+RESULTS:
#+begin_example
[[Fit Statistics]]
    # function evals   = 15
    # data points      = 30
    # variables        = 2
    chi-square         = 11.414
    reduced chi-square = 0.408
    Akaike info crit   = -24.991
    Bayesian info crit = -22.188
[[Variables]]
    xc:   0.22707331 +/- 0.389464 (171.52%) (init= 0.2886785)
    yc:  -65.0888304 +/- 1.950807 (3.00%) (init=-84.06985)
[[Correlations]] (unreported correlations are <  0.100)
    C(xc, yc)                    =  0.160 
outer : 0.227073314289 -65.0888304071 149.803410692
#+end_example

#+BEGIN_SRC sh :results file
python shape-conic-plot.py M17-HD2040 
#+END_SRC

#+RESULTS:
[[file:shape-conic-plot-M17-HD2040.pdf]]



*** Reflect the one-sided arcs to make symmetrical
+ The dust emission images show only one side, but we need the make it symmetric so that ~find-xy-shell.py~ will work
+ Easiest to add an argument to [[file:~/Work/Bowshocks/Jorge/bowshock-shape/read-shapes-LL/find-xy-shell.py]]
  
#+BEGIN_SRC sh :results verbatim
  D=../read-shapes-LL
  for inc in i30 i60 i45; do
      python $D/find-xy-shell.py M17-MHD2040-AllB7-60mic-$inc --mirror --pa0 0 --window 11
      python $D/fit-circle-shell.py M17-MHD2040-AllB7-60mic-$inc --thmax 60 --savefig --figscale 60
  done
#+END_SRC

#+RESULTS:
#+begin_example
[[Fit Statistics]]
    # function evals   = 27
    # data points      = 22
    # variables        = 2
    chi-square         = 0.438
    reduced chi-square = 0.022
    Akaike info crit   = -82.154
    Bayesian info crit = -79.972
[[Variables]]
    xc:  -1.2970e-05 +/- 0.101708 (784188.97%) (init= 0.1209432)
    yc:  -22.7386327 +/- 0.703891 (3.10%) (init=-19.93934)
[[Correlations]] (unreported correlations are <  0.100)
outer : -1.29698792652e-05 -22.7386327356 42.7447694992
[[Fit Statistics]]
    # function evals   = 21
    # data points      = 28
    # variables        = 2
    chi-square         = 0.138
    reduced chi-square = 0.005
    Akaike info crit   = -144.795
    Bayesian info crit = -142.130
[[Variables]]
    xc:   5.8569e-05 +/- 0.032565 (55602.00%) (init= 0.2651148)
    yc:  -14.0758912 +/- 0.165202 (1.17%) (init=-27.47579)
[[Correlations]] (unreported correlations are <  0.100)
outer : 5.85687233641e-05 -14.0758912464 41.5707665446
[[Fit Statistics]]
    # function evals   = 15
    # data points      = 25
    # variables        = 2
    chi-square         = 0.300
    reduced chi-square = 0.013
    Akaike info crit   = -106.545
    Bayesian info crit = -104.107
[[Variables]]
    xc:   0.01421278 +/- 0.061255 (430.99%) (init=-0.2295599)
    yc:  -16.3314669 +/- 0.336181 (2.06%) (init=-23.30099)
[[Correlations]] (unreported correlations are <  0.100)
    C(xc, yc)                    =  0.138 
outer : 0.0142127841643 -16.3314669423 39.7077872798
#+end_example

#+BEGIN_SRC sh :results verbatim
  D=../read-shapes-LL
  for inc in i30 i60 i45; do
      python $D/find-xy-shell.py M17-HD2040-60mic-$inc --mirror --pa0 0 --window 11
      python $D/fit-circle-shell.py M17-HD2040-60mic-$inc --thmax 60 --savefig --figscale 120
  done
#+END_SRC

#+RESULTS:
#+begin_example
[[Fit Statistics]]
    # function evals   = 15
    # data points      = 32
    # variables        = 2
    chi-square         = 8.233
    reduced chi-square = 0.274
    Akaike info crit   = -39.442
    Bayesian info crit = -36.510
[[Variables]]
    xc:  -0.00030196 +/- 0.304693 (100906.07%) (init= 0.1526615)
    yc:  -42.8230678 +/- 1.771714 (4.14%) (init=-48.36428)
[[Correlations]] (unreported correlations are <  0.100)
outer : -0.000301957199037 -42.8230678902 91.3310510027
[[Fit Statistics]]
    # function evals   = 15
    # data points      = 39
    # variables        = 2
    chi-square         = 6.376
    reduced chi-square = 0.172
    Akaike info crit   = -66.632
    Bayesian info crit = -63.305
[[Variables]]
    xc:   0.04778295 +/- 0.222363 (465.36%) (init=-1.559587)
    yc:  -46.3992588 +/- 1.226260 (2.64%) (init=-70.0189)
[[Correlations]] (unreported correlations are <  0.100)
    C(xc, yc)                    =  0.166 
outer : 0.0477829592257 -46.399258795 116.146909206
[[Fit Statistics]]
    # function evals   = 15
    # data points      = 36
    # variables        = 2
    chi-square         = 4.781
    reduced chi-square = 0.141
    Akaike info crit   = -68.677
    Bayesian info crit = -65.510
[[Variables]]
    xc:  -0.00943907 +/- 0.221300 (2344.52%) (init= 6.938018)
    yc:  -49.0033081 +/- 1.117650 (2.28%) (init=-55.76348)
[[Correlations]] (unreported correlations are <  0.100)
    C(xc, yc)                    = -0.456 
outer : -0.00943907485149 -49.003308165 104.97190652
#+end_example

#+BEGIN_SRC sh :results verbatim
  D=../read-shapes-LL
  for suff in Halpha-i00 Halpha-i00-BS Halpha-i00-CD; do
      python $D/find-xy-shell.py M17-HD2040-$suff --mirror --pa0 0 --window 11
      python $D/fit-circle-shell.py M17-HD2040-$suff --thmax 60 --savefig --figscale 400
  done
  python $D/find-xy-shell.py  M17-MHD2040-AllB7-Halpha-i00 --mirror --pa0 0 --window 11
  python $D/fit-circle-shell.py M17-MHD2040-AllB7-Halpha-i00 --thmax 60 --savefig --figscale 300
#+END_SRC

#+RESULTS:
#+begin_example
[[Fit Statistics]]
    # function evals   = 21
    # data points      = 58
    # variables        = 2
    chi-square         = 15408.678
    reduced chi-square = 275.155
    Akaike info crit   = 327.770
    Bayesian info crit = 331.891
[[Variables]]
    xc:   0.00586830 +/- 10.45830 (178216.68%) (init= 3.196789)
    yc:  -249.522490 +/- 99.82762 (40.01%) (init=-123.2418)
[[Correlations]] (unreported correlations are <  0.100)
outer : 0.00586830732259 -249.522490891 362.179923057
[[Fit Statistics]]
    # function evals   = 23
    # data points      = 30
    # variables        = 2
    chi-square         = 6.015
    reduced chi-square = 0.215
    Akaike info crit   = -44.211
    Bayesian info crit = -41.408
[[Variables]]
    xc:  -0.00011207 +/- 0.280072 (249901.49%) (init=-0.08722588)
    yc:  -150.816486 +/- 1.915869 (1.27%) (init=-131.3879)
[[Correlations]] (unreported correlations are <  0.100)
outer : -0.000112072966344 -150.816486465 282.263586833
[[Fit Statistics]]
    # function evals   = 21
    # data points      = 28
    # variables        = 2
    chi-square         = 89.901
    reduced chi-square = 3.458
    Akaike info crit   = 36.662
    Bayesian info crit = 39.327
[[Variables]]
    xc:   8.2207e-07 +/- 1.023625 (124517821.61%) (init= 0.1989897)
    yc:  -92.7969269 +/- 6.603755 (7.12%) (init=-99.17076)
[[Correlations]] (unreported correlations are <  0.100)
outer : 8.22071275621e-07 -92.7969269403 193.944678758
[[Fit Statistics]]
    # function evals   = 33
    # data points      = 26
    # variables        = 2
    chi-square         = 20.523
    reduced chi-square = 0.855
    Akaike info crit   = -2.150
    Bayesian info crit = 0.366
[[Variables]]
    xc:  -3.5984e-05 +/- 1.326028 (3685052.33%) (init=-0.005741513)
    yc:  -234.403509 +/- 21.90155 (9.34%) (init=-62.3199)
[[Correlations]] (unreported correlations are <  0.100)
    C(xc, yc)                    =  0.131 
outer : -3.59839760123e-05 -234.403509502 297.923251224
#+end_example

** Fit arcs to Meyer 2016 shapes
#+BEGIN_SRC sh :results verbatim
  D=../read-shapes-LL
  python $D/find-xy-shell.py M16-MS2070n00p10-CD --pa0 0 --window 11
  python $D/fit-circle-shell.py M16-MS2070n00p10-CD --thmax 45 --savefig --figscale 400
#+END_SRC

#+RESULTS:
#+begin_example
[[Fit Statistics]]
    # function evals   = 15
    # data points      = 20
    # variables        = 2
    chi-square         = 2.710
    reduced chi-square = 0.151
    Akaike info crit   = -35.975
    Bayesian info crit = -33.983
[[Variables]]
    xc:   0.33132410 +/- 0.328603 (99.18%) (init= 0.3099345)
    yc:  -90.3086796 +/- 2.550881 (2.82%) (init=-129.4369)
[[Correlations]] (unreported correlations are <  0.100)
    C(xc, yc)                    =  0.109 
outer : 0.331324102216 -90.308679631 219.628145297
#+end_example


#+BEGIN_SRC sh :results silent
open M16-MS2070n00p10-*-arcfits.pdf
#+END_SRC

#+BEGIN_SRC sh :results verbatim
  D=../read-shapes-LL
  python $D/find-xy-shell.py M16-MS2070n00p10-BS --pa0 0 --window 10
  python $D/fit-circle-shell.py M16-MS2070n00p10-BS --thmax 45 --savefig --figscale 400
#+END_SRC

#+RESULTS:
#+begin_example
[[Fit Statistics]]
    # function evals   = 15
    # data points      = 23
    # variables        = 2
    chi-square         = 3.442
    reduced chi-square = 0.164
    Akaike info crit   = -39.685
    Bayesian info crit = -37.414
[[Variables]]
    xc:   0.97394196 +/- 0.352750 (36.22%) (init= 0.4950382)
    yc:  -129.062380 +/- 3.048129 (2.36%) (init=-149.6037)
[[Correlations]] (unreported correlations are <  0.100)
    C(xc, yc)                    =  0.100 
outer : 0.973941961957 -129.062380349 278.408680128
#+end_example


#+BEGIN_SRC sh :results file
python shape-conic-plot.py M16-MS2070n00p10
#+END_SRC

#+RESULTS:
[[file:shape-conic-plot-M16-MS2070n00p10.pdf]]



*** Harvest shape parameters
#+name: harvest-radii-m17
#+BEGIN_SRC python :return table
  import json

  SOURCES = [
      "M17-MHD2040-AllB7",
      "M17-MHD2040-AllB7-Halpha-i00",
      "M17-MHD2040-AllB7-60mic-i30",
      "M17-MHD2040-AllB7-60mic-i45",
      "M17-MHD2040-AllB7-60mic-i60",
      "M17-HD2040",
      "M17-HD2040-Halpha-i00-CD",
      "M17-HD2040-60mic-i30",
      "M17-HD2040-60mic-i45",
      "M17-HD2040-60mic-i60",
  ]

  radii_header = ['R0/100', 'Rc/R0', 'R90/R0', 'Rm90/R0']
  header = [['Source', *radii_header], None]
  INVALID = -999.00
  body = []
  for source in SOURCES:
      jfile = f'{source}-arcdata.json'
      data = json.load(open(jfile))
      assert source == data['star']['id']
      D = data['star']['D']
      row = [source]
      arc = 'outer'
      if arc in data:
          R0 = data[arc]['R0']
          Rc = data[arc]['Rc'] / R0
          if 'R90' in data[arc]:
              Rm90, R90 = data[arc]['R90']
              if Rm90 > 0.0:
                  Rm90 /= R0
              if R90 > 0.0:
                  R90 /= R0
          else:
              Rm90, R90 = INVALID, INVALID
          row += [f'{_:.2f}' for _ in [R0/100.0, Rc, Rm90, R90]]
      else:
          row += [f'{_:.2f}' for _ in [INVALID, INVALID, INVALID, INVALID]]
      body.append(row)

  #body.sort(key=lambda x: x[0])
  table = header + body

#+END_SRC

#+RESULTS: harvest-radii-m17
| Source                       | R0/100 | Rc/R0 | R90/R0 | Rm90/R0 |
|------------------------------+--------+-------+--------+---------|
| M17-MHD2040-AllB7            |   0.48 |  3.57 |   1.95 |    1.92 |
| M17-MHD2040-AllB7-Halpha-i00 |   0.62 |  4.78 |   2.21 |    2.21 |
| M17-MHD2040-AllB7-60mic-i30  |   0.20 |  2.14 |   1.74 |    1.73 |
| M17-MHD2040-AllB7-60mic-i45  |   0.23 |  1.70 |   1.59 |    1.61 |
| M17-MHD2040-AllB7-60mic-i60  |   0.27 |  1.51 |   1.47 |    1.46 |
| M17-HD2040                   |   0.84 |  1.78 |   1.75 |    1.75 |
| M17-HD2040-Halpha-i00-CD     |   0.99 |  1.96 |   2.09 |    2.08 |
| M17-HD2040-60mic-i30         |   0.48 |  1.89 |   1.80 |    1.79 |
| M17-HD2040-60mic-i45         |   0.56 |  1.87 |   1.90 |    1.59 |
| M17-HD2040-60mic-i60         |   0.70 |  1.66 |   1.55 |    1.59 |



*** Harvest the shape parameters from the JSON files
+ Do it like in [[id:A3F62646-04B8-448B-91FF-8E1DC04A9C41][The red supergiants and AGB stars]]

#+BEGIN_SRC sh :results verbatim
ls *.json |cut -d'-' -f1-3
#+END_SRC

#+RESULTS:
#+begin_example
A16-12mic-i00
A16-12mic-i30
A16-12mic-i60
A16-20mic-i00
A16-20mic-i30
A16-20mic-i60
A16-Halpha-i00
A16-Halpha-i30
A16-Halpha-i60
R97-Halpha-i00
#+end_example

#+name: harvest-radii-sims
#+BEGIN_SRC python :return table
  import json

  SOURCES = [
      "A16-12mic-i00", 
      "A16-12mic-i30", 
      "A16-12mic-i60", 
      "A16-20mic-i00", 
      "A16-20mic-i30", 
      "A16-20mic-i60", 
      "A16-Halpha-i00", 
      "A16-Halpha-i30", 
      "A16-Halpha-i60", 
      "R97-Halpha-i00", 
  ]

  radii_header = ['R0/100', 'Rc/R0', 'R90/R0', 'Rm90/R0']
  header = [['Source', *radii_header], None]
  INVALID = -999.00
  body = []
  for source in SOURCES:
      jfile = f'{source}-arcdata.json'
      data = json.load(open(jfile))
      assert source == data['star']['id']
      D = data['star']['D']
      row = [source]
      arc = 'outer'
      if arc in data:
          R0 = data[arc]['R0']
          Rc = data[arc]['Rc'] / R0
          if 'R90' in data[arc]:
              Rm90, R90 = data[arc]['R90']
              if Rm90 > 0.0:
                  Rm90 /= R0
              if R90 > 0.0:
                  R90 /= R0
          else:
              Rm90, R90 = INVALID, INVALID
          row += [f'{_:.2f}' for _ in [R0/100.0, Rc, Rm90, R90]]
      else:
          row += [f'{_:.2f}' for _ in [INVALID, INVALID, INVALID, INVALID]]
      body.append(row)

  #body.sort(key=lambda x: x[0])
  table = header + body

#+END_SRC

#+RESULTS: harvest-radii-sims
| Source         | R0/100 | Rc/R0 | R90/R0 | Rm90/R0 |
|----------------+--------+-------+--------+---------|
| A16-12mic-i00  |   0.44 |  2.59 |   1.69 |    1.69 |
| A16-12mic-i30  |   0.42 |  2.90 |   1.97 |    1.88 |
| A16-12mic-i60  |   0.54 |  1.90 |   1.45 |    1.42 |
| A16-20mic-i00  |   0.41 |  2.05 |   1.75 |    1.87 |
| A16-20mic-i30  |   0.40 |  2.41 |   1.96 |    1.97 |
| A16-20mic-i60  |   0.43 |  4.94 |   1.78 |    1.82 |
| A16-Halpha-i00 |   0.52 |  1.83 |   1.57 |    1.79 |
| A16-Halpha-i30 |   0.63 |  2.25 |   1.53 |    1.54 |
| A16-Halpha-i60 |   0.81 |  1.37 |   1.38 |    1.38 |
| R97-Halpha-i00 |   0.92 |  1.55 |   2.16 |    2.09 |

